-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-04-16 07:46:07
-- 伺服器版本： 10.4.27-MariaDB
-- PHP 版本： 8.0.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fund`
--

-- --------------------------------------------------------

--
-- 資料表結構 `allianz`
--

CREATE TABLE `allianz` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `company` varchar(100) NOT NULL,
  `day` varchar(100) NOT NULL,
  `OneMonth` double DEFAULT NULL,
  `ThreeMonth` double DEFAULT NULL,
  `SixMonth` double DEFAULT NULL,
  `OneYear` double DEFAULT NULL,
  `ThreeYear` double DEFAULT NULL,
  `FiveYear` double DEFAULT NULL,
  `TenYear` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `allianz`
--

INSERT INTO `allianz` (`id`, `name`, `company`, `day`, `OneMonth`, `ThreeMonth`, `SixMonth`, `OneYear`, `ThreeYear`, `FiveYear`, `TenYear`) VALUES
(1, '路博邁台灣5G股票基金N累積型(基金之配息來源可能為本金)', '路博邁投信', '2月2日', 10.59, 20.17, 16.12, -1.47, 13.8, 0, 0),
(2, '凱基開創基金', '凱基投信', '2月2日', 12.29, 23.72, 14, -1.5, 73.08, 98.43, 256.14),
(3, '路博邁台灣5G股票基金T累積型(基金之配息來源可能為本金)', '路博邁投信', '2月2日', 10.63, 20.12, 16.08, -1.53, 38.32, 43.07, 0),
(4, '路博邁台灣5G股票基金T月配型(基金之配息來源可能為本金)', '路博邁投信', '2月2日', 10.66, 20.12, 16.05, -1.55, 38.42, 43.06, 0),
(5, '路博邁台灣5G股票基金N月配型(基金之配息來源可能為本金)', '路博邁投信', '2月2日', 10.63, 20.06, 16, -1.57, 49.1, 0, 0),
(6, '兆豐國民基金', '兆豐投信', '2月2日', 10.17, 20.57, 13.1, -3.23, 50.14, 57.88, 99.35),
(7, '匯豐成功基金', '匯豐投信', '2月2日', 2.89, 15.06, 6.35, -4.55, 23.18, 30.02, 73.25),
(8, '兆豐豐台灣基金', '兆豐投信', '2月2日', 9.3, 18.02, 10.21, -5.18, 49.91, 76.67, 149.24),
(9, '永豐臺灣ESG永續優選基金-年配型', '永豐投信', '2月2日', 7.95, 14.22, 5.94, -5.89, 0, 0, 0),
(10, '柏瑞巨人基金', '柏瑞投信', '2月2日', 8.67, 14.48, 6.01, -5.9, 34.57, 38.46, 119.83),
(11, '永豐臺灣ESG永續優選基金-I類型', '永豐投信', '2月2日', 7.94, 14.12, 5.9, -5.95, 0, 0, 0),
(12, '永豐臺灣ESG永續優選基金-累積型', '永豐投信', '2月2日', 7.94, 14.12, 5.9, -5.95, 0, 0, 0),
(13, '街口台灣基金', '街口投信', '2月2日', 9.38, 19.33, 9.6, -5.95, 42.67, 40.88, 114.63),
(14, '富蘭克林華美第一富基金', '富蘭克林華美投信', '2月2日', 6.62, 17.91, 9.62, -6.67, 71.95, 77.93, 226.32),
(15, '兆豐第一基金', '兆豐投信', '2月2日', 8.23, 11.59, 3.48, -6.7, 72.67, 91.99, 166.46),
(16, 'PGIM保德信新世紀基金-R累積型', '保德信投信', '2月2日', 6.76, 14.64, 4.12, -7.04, 0, 0, 0),
(17, '統一黑馬基金', '統一投信', '2月2日', 9.05, 17.57, 10.26, -7.12, 103.02, 132.65, 365.87),
(18, '兆豐台灣金傳精選股息基金N後收型(台幣)', '兆豐投信', '2月2日', 5.72, 11.03, 1.68, -7.17, 0, 0, 0),
(19, '兆豐台灣金傳精選股息基金A累積型(台幣)', '兆豐投信', '2月2日', 5.6, 10.91, 1.57, -7.18, 0, 0, 0),
(20, '國泰台灣高股息基金-A不配息(台幣)', '國泰投信', '2月2日', 6.18, 10.15, 5.23, -7.51, 0, 0, 0),
(21, 'PGIM保德信新世紀基金-A累積型', '保德信投信', '2月2日', 6.67, 14.5, 3.88, -7.61, 24.86, 30.32, 66.79),
(22, '國泰台灣高股息基金-B配息(台幣)', '國泰投信', '2月2日', 5.9, 10.17, 5.27, -7.77, 0, 0, 0),
(23, '宏利臺灣股息收益基金A類', '宏利投信', '2月2日', 7.75, 11.38, 5.78, -8.59, 35.07, 32.18, 140.09),
(24, '聯博大利基金', '聯博投信', '2月2日', 13.28, 21.48, 9.72, -9.06, 46.32, 52.56, 140.98),
(25, '貝萊德寶利基金', '貝萊德投信', '2月2日', 11.28, 15.66, 7.37, -9.2, 44.31, 70.1, 305.2),
(26, '景順潛力基金', '景順投信', '2月2日', 13.62, 19.04, 10.49, -9.22, 22.46, 15.84, 70.76),
(27, '匯豐台灣精典基金', '匯豐投信', '2月2日', 10.04, 15.71, 7.12, -9.35, 42.81, 53.94, 124.04),
(28, '統一龍馬基金', '統一投信', '2月2日', 9.46, 14.28, 7.16, -9.4, 53.5, 75.73, 252.22),
(29, '摩根台灣增長基金', '摩根投信', '2月2日', 8.48, 15.44, 5.52, -9.7, 31.09, 35.03, 109.43),
(30, '德銀遠東DWS台灣旗艦基金', '德銀遠東投信', '2月2日', 10.07, 14.77, 3.55, -9.75, 61.13, 77.4, 102.49),
(31, '統一大滿貫基金', '統一投信', '2月2日', 9.52, 14.3, 7.4, -9.75, 34.12, 60.87, 170.8),
(32, '匯豐龍鳳基金R類型', '匯豐投信', '2月2日', 8.6, 14.39, 6.28, -9.82, 0, 0, 0),
(33, '野村鴻運基金', '野村投信', '2月2日', 14.35, 23.31, 14.17, -10.05, 94.79, 100.87, 274.57),
(34, '匯豐龍鳳基金', '匯豐投信', '2月2日', 8.57, 14.27, 6.07, -10.18, 43.29, 56.18, 133.72),
(35, '華南永昌永昌基金', '華南永昌投信', '2月2日', 7.54, 17.06, 14.07, -10.37, 80.75, 89.13, 270.51),
(36, '景順主流基金', '景順投信', '2月2日', 13.94, 19.77, 10.2, -10.48, 39.78, 42.94, 115.65),
(37, '凱基台灣精五門基金', '凱基投信', '2月2日', 8.33, 14.71, 5, -10.78, 49.81, 67.56, 149.93),
(38, '統一台灣動力基金', '統一投信', '2月2日', 8.89, 13.9, 8.82, -10.83, 62.12, 115.41, 335.82),
(39, '宏利台灣動力基金I類', '宏利投信', '2月2日', 11.7, 17.13, 8.32, -11.01, 58.97, 0, 0),
(40, '野村優質基金-累積S類型(台幣)', '野村投信', '2月2日', 15.68, 25.96, 15.52, -11.43, 104.43, 0, 0),
(41, '日盛精選五虎基金', '日盛投信', '2月2日', 10.61, 15.84, -0.38, -11.58, 58.51, 64.67, 184.02),
(42, '富邦精準基金', '富邦投信', '2月2日', 10.92, 22.03, 13.56, -11.63, 70.55, 80.8, 123.89),
(43, '野村台灣運籌基金', '野村投信', '2月2日', 12.95, 20.42, 12.8, -11.76, 68.06, 89.03, 324),
(44, '野村優質基金', '野村投信', '2月2日', 15.63, 25.84, 15.24, -11.89, 101.43, 153.62, 357.39),
(45, '宏利台灣動力基金A類', '宏利投信', '2月2日', 11.56, 16.81, 7.77, -11.93, 54.83, 67.65, 256.25),
(46, '野村成長基金', '野村投信', '2月2日', 11.65, 21.29, 12.98, -11.99, 87.81, 127.86, 300.29),
(47, '新光台灣富貴基金', '新光投信', '2月2日', 11.06, 18.15, 8.99, -12.03, 95.68, 105.43, 224.79),
(48, '野村積極成長基金', '野村投信', '2月2日', 11.86, 21.33, 13.19, -12.24, 86.65, 127.9, 304.37),
(49, '群益葛萊美基金', '群益投信', '2月2日', 9.89, 16, 2.78, -12.5, 47.56, 63.15, 198.08),
(50, '台中銀大發基金', '台中銀投信', '2月2日', 8.86, 11.64, 2.39, -13.58, 34.77, 42.94, 151.24),
(51, '富邦富邦基金', '富邦投信', '2月2日', 8.91, 18.16, 9.95, -14.74, 56.9, 87.4, 183.09),
(52, '日盛首選基金', '日盛投信', '2月2日', 12.21, 17.44, 6.82, -14.81, 23.5, 44.36, 162.23),
(53, '富邦高成長基金', '富邦投信', '2月2日', 10.82, 15.96, 8.27, -14.85, 61.56, 80.86, 188.59),
(54, '摩根台灣金磚基金-累積型', '摩根投信', '2月2日', 12.57, 21.13, 10.61, -15.02, 46.83, 48.59, 182.71),
(55, '統一統信基金', '統一投信', '2月2日', 12.65, 20.32, 10.27, -15.47, 53.46, 60.17, 179.89),
(56, '日盛MIT主流基金', '日盛投信', '2月2日', 11.59, 18.18, 1.92, -15.74, 47.88, 59.57, 150.94),
(57, '富邦台灣心基金', '富邦投信', '2月2日', 8.71, 18.04, 8.48, -16.02, 65.94, 92.87, 229.28),
(58, '台新主流基金', '台新投信', '2月2日', 11.58, 20.57, 10.96, -16.08, 32.06, 38.95, 207.18),
(59, '日盛台灣永續成長股息基金', '日盛投信', '2月2日', 12, 20.47, 3.36, -16.3, 0, 0, 0),
(60, '新光大三通基金', '新光投信', '2月2日', 9.03, 18.79, 7.94, -16.35, 99.9, 94.05, 189.07),
(61, '國泰國泰基金-I類型', '國泰投信', '2月2日', 9.36, 11.04, 4.81, -16.36, 56.35, 0, 0),
(62, '國泰國泰基金', '國泰投信', '2月2日', 9.36, 11.04, 4.81, -16.36, 56.35, 65.36, 194.35),
(63, '群益長安基金', '群益投信', '2月2日', 8.76, 14.37, 0.51, -16.37, 48.85, 59.55, 197.42),
(64, '第一金創新趨勢基金', '第一金投信', '2月2日', 11.39, 14.88, 5.91, -16.54, 32.89, 41.39, 190.68),
(65, '元大二○○一基金', '元大投信', '2月2日', 9.92, 15.27, 7.17, -16.63, 47.81, 60.86, 227.08),
(66, '安聯台灣智慧基金', '安聯投信', '2月2日', 11.07, 17.81, 5.8, -16.67, 70.59, 160.15, 527.65),
(67, '永豐永豐基金-R類型', '永豐投信', '2月2日', 8.19, 11.57, 3.04, -16.92, 0, 0, 0),
(68, '元大多多基金', '元大投信', '2月2日', 9.44, 14.3, 5.95, -17.05, 38.94, 41, 112.32),
(69, '合庫台灣高科技基金', '合作金庫投信', '2月2日', 6.92, 1.78, -6.94, -17.15, 0, 0, 0),
(70, '永豐永豐基金-A類型', '永豐投信', '2月2日', 8.13, 11.35, 2.67, -17.51, 8.9, 14.01, 43.38),
(71, '永豐永豐基金-I類型', '永豐投信', '2月2日', 8.13, 11.35, 2.67, -17.51, 8.9, 0, 0),
(72, '元大多福基金', '元大投信', '2月2日', 10.57, 15.49, 7.34, -17.66, 30.8, 30.99, 97.35),
(73, '統一全天候基金', '統一投信', '2月2日', 9.29, 16.45, 5.64, -17.86, 43.87, 68.23, 278.41),
(74, '瀚亞外銷基金', '瀚亞投信', '2月2日', 11.68, 14.57, 7.01, -18.26, 43.2, 50.08, 137),
(75, '國泰小龍基金-R類型(台幣)', '國泰投信', '2月2日', 9.86, 12.63, 4.55, -18.38, 0, 0, 0),
(76, '群益馬拉松基金', '群益投信', '2月2日', 7.87, 11, 3.36, -18.45, 7.12, 15, 113.69),
(77, '群益馬拉松基金N類型', '群益投信', '2月2日', 7.86, 10.99, 3.36, -18.46, 0, 0, 0),
(78, '國泰小龍基金(台幣)', '國泰投信', '2月2日', 9.84, 12.57, 4.42, -18.58, 39.1, 37, 96.87),
(79, '統一經建基金', '統一投信', '2月2日', 7.54, 12.96, 4, -18.64, 48.97, 73.18, 271.09),
(80, '富邦台灣永續發展高股息基金B配息', '富邦投信', '2月2日', 9.33, 16.4, 6.2, -18.94, 0, 0, 0),
(81, '富邦台灣永續發展高股息基金A不配息', '富邦投信', '2月2日', 9.23, 16.32, 6.1, -18.97, 0, 0, 0),
(82, '合庫台灣基金', '合作金庫投信', '2月2日', 6.1, 2.49, -4.48, -19.02, 34.77, 43.98, 73.81),
(83, '元大新主流基金', '元大投信', '2月2日', 11.87, 15.54, 6.32, -19.04, 34.52, 47.61, 134.78),
(84, 'PGIM保德信金滿意基金-R累積型', '保德信投信', '2月2日', 7.95, 14.95, 3.16, -19.07, 0, 0, 0),
(85, '群益奧斯卡基金', '群益投信', '2月2日', 21.03, 22.99, 9.37, -19.09, 46.5, 68.68, 181.07),
(86, '富邦長紅基金', '富邦投信', '2月2日', 9.66, 15.69, 4.4, -19.18, 52.85, 65.42, 158.09),
(87, 'PGIM保德信金滿意基金-A累積型', '保德信投信', '2月2日', 7.94, 14.8, 2.9, -19.59, 19.09, 34.79, 90.46),
(88, 'PGIM保德信高成長基金', '保德信投信', '2月2日', 9.44, 14.7, 4.07, -19.75, 32.68, 68.76, 142.44),
(89, '復華復華基金', '復華投信', '2月2日', 11.5, 18.72, 7.78, -19.87, 18.21, 37.98, 210.88),
(90, '日盛日盛基金', '日盛投信', '2月2日', 10.57, 13.34, -1.58, -20.3, 10.64, 26.94, 98.32),
(91, '復華全方位基金', '復華投信', '2月2日', 10.11, 13.41, 3.34, -21.22, 28.63, 55.6, 263.69),
(92, '元大台灣高股息優質龍頭基金A不配息', '元大投信', '2月2日', 8.17, 9.8, 2.01, -21.23, 0, 0, 0),
(93, '元大台灣高股息優質龍頭基金I不配息', '元大投信', '2月2日', 8.17, 9.6, 1.92, -21.23, 0, 0, 0),
(94, '元大台灣高股息優質龍頭基金B配息(本基金之配息來源可能為收益平準金)', '元大投信', '2月2日', 7.71, 9.87, 2.03, -21.56, 0, 0, 0),
(95, '安聯台灣大壩基金-G累積型(台幣)', '安聯投信', '2月2日', 9.42, 13.79, 0.12, -21.58, 55.7, 0, 0),
(96, '瀚亞菁華基金', '瀚亞投信', '2月2日', 10.25, 12.06, 5.22, -21.65, 47.45, 51.51, 127.42),
(97, '元大台灣高股息優質龍頭基金I配息(本基金之配息來源可能為收益平準金)', '元大投信', '2月2日', 7.69, 9.99, 2.15, -21.85, 0, 0, 0),
(98, '安聯台灣大壩基金-A累積型(台幣)', '安聯投信', '2月2日', 9.34, 13.48, -0.37, -22.39, 51.06, 122.37, 416.21),
(99, '日盛上選基金-A類型', '日盛投信', '2月2日', 11.54, 18.95, 2.76, -22.94, 33.44, 60.04, 186.79),
(100, '日盛上選基金-I類型', '日盛投信', '2月2日', 11.54, 18.95, 2.76, -22.94, 33.44, 0, 0),
(101, '日盛上選基金-N類型', '日盛投信', '2月2日', 11.54, 18.92, 2.74, -22.95, 0, 0, 0),
(102, '復華台灣好收益基金', '復華投信', '2月2日', 13.31, 18.73, 5.9, -23.22, 0, 0, 0),
(103, '國泰小龍基金-I類型(美元)', '國泰投信', '2月2日', 13.66, 21.94, 5.58, -23.94, 41.52, 0, 0),
(104, '元大卓越基金', '元大投信', '2月2日', 8.42, 11.57, 4.1, -24, 13.39, -5.09, 52.95),
(105, '復華高成長基金', '復華投信', '2月2日', 9.22, 12.54, 0.66, -25.47, 15.57, 36.29, 238.42),
(106, '元大經貿基金', '元大投信', '2月2日', 8.12, 10.76, 1.67, -29.25, 10.26, 19.43, 102.68),
(107, '摩根台灣金磚基金-機構法人型', '摩根投信', '2月2日', 0, -61.01, -64.4, -72.65, -52.74, 0, 0),
(108, '摩根台灣金磚基金-數位型', '摩根投信', '2月2日', 0, 0, 0, 0, 0, 0, 0),
(109, '台中銀台灣優息基金A累積型(台幣)', '台中銀投信', '2月2日', 6.2, 15.88, 18.56, 0, 0, 0, 0),
(110, '台中銀台灣優息基金B月配型(台幣)', '台中銀投信', '2月2日', 5.48, 15.1, 17.75, 0, 0, 0, 0),
(111, '台中銀台灣優息基金C累積型(台幣)', '台中銀投信', '2月2日', 6.2, 15.88, 18.56, 0, 0, 0, 0),
(112, '台中銀台灣優息基金N月配型(台幣)', '台中銀投信', '2月2日', 5.57, 15.2, 17.85, 0, 0, 0, 0),
(113, '匯豐龍鳳基金I類型', '匯豐投信', '2月2日', 8.62, 14.43, 0, 0, 43.54, 0, 0),
(114, '群益馬拉松基金I類型', '群益投信', '2月2日', 4.16, 4.37, 0, 0, 0, 0, 0),
(115, '柏瑞巨人基金I不配息(台幣)', '柏瑞投信', '2月1日', 0, 0, 0, 0, 0, 0, 0),
(116, '新光臺灣高股息基金-A不配息(台幣)', '新光投信', '2月2日', 7.62, 13.71, 3.77, 0, 0, 0, 0),
(117, '新光臺灣高股息基金-B月配息(台幣)', '新光投信', '2月2日', 7.62, 13.71, 3.77, 0, 0, 0, 0),
(118, '第一金台灣核心戰略建設基金A不配息(台幣)(本基金配息來源可能為本金)', '第一金投信', '2月2日', 8.5, 11.62, 2, 0, 0, 0, 0),
(119, '第一金台灣核心戰略建設基金B配息(台幣)(本基金配息來源可能為本金)', '第一金投信', '2月2日', 8.1, 11.24, 1.61, 0, 0, 0, 0),
(120, '第一金台灣核心戰略建設基金N不配息(台幣)(本基金配息來源可能為本金)', '第一金投信', '2月2日', 8.39, 11.51, 1.89, 0, 0, 0, 0),
(121, '第一金台灣核心戰略建設基金N配息(台幣)(本基金配息來源可能為本金)', '第一金投信', '2月2日', 8.1, 11.24, 1.61, 0, 0, 0, 0),
(122, '路博邁台灣5G股票基金I月配型(基金之配息來源可能為本金)', '路博邁投信', '2月2日', 0, 0, 0, 0, 0, 0, 0),
(123, '路博邁台灣5G股票基金I累積型(基金之配息來源可能為本金)', '路博邁投信', '2月2日', 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `observe`
--

CREATE TABLE `observe` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `company` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 傾印資料表的資料 `observe`
--

INSERT INTO `observe` (`id`, `name`, `company`) VALUES
(1, '路博邁台灣5G股票基金N累積型(基金之配息來源可能為本金)', '路博邁投信'),
(3, '路博邁台灣5G股票基金T累積型(基金之配息來源可能為本金)', '路博邁投信'),
(5, '路博邁台灣5G股票基金N月配型(基金之配息來源可能為本金)', '路博邁投信');

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

CREATE TABLE `user` (
  `id` int(100) NOT NULL,
  `account` varchar(100) NOT NULL,
  `passwd` varchar(100) NOT NULL,
  `realname` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `allianz`
--
ALTER TABLE `allianz`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `observe`
--
ALTER TABLE `observe`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `allianz`
--
ALTER TABLE `allianz`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=124;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `user`
--
ALTER TABLE `user`
  MODIFY `id` int(100) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
